Repository: PalAlexNewYork/EnglishWebSimulatorApp
Catalog: EnglishWebSimulatorApp/Resources/Views/Home/AboutApp.*.resx
Languages: ru

# dictionary1
source: The application has the ability to work with a dictionary, which at the initial stage has 8000 words, replenished by the site administrator. The user's work with the dictionary includes two training modes, which differ in that in the knowledge test mode at the end of the lesson, the result is automatically saved and the incorrectly entered word is no longer repeated, a page with an error notification is displayed.
ru: В приложении осуществлена возможность работы со словарём, который на начальном этапе имеет 8000 слов, пополняемых администратором сайта. Работа пользователя со словарём включает в себя два режима тренировок, которые отличаются тем что в режиме проверки знаний по окончанию урока результат автоматически сохраняется а неправильно введенное слово больше не повторяется, выводится страница с оповещение ошибки.

# dictionary2
source: It is also possible to view words in the form of cards, to go to the next one you need to press the NEXT button, to go to a certain word you need to enter a number and click on the bird.
ru: Также можно просматривать слова в виде карточек, чтобы перейти к следующему, нужно нажать кнопку ДАЛЕЕ, чтобы перейти к определенному слову, нужно ввести цифру и нажать на птичку.

# dictionary3
source: Regardless of your choice of training or knowledge testing, in any case, you will be directed to a page with the settings for selecting a list of words.
ru: Независимо от вашего выбора обучения или проверки знаний, в любом случае вы будете перенаправлены на страницу с настройками для выбора списка слов.

# dictionary4
source: The training mode with a dictionary is similar to the training mode with the user's words, there is also a panel for displaying the remaining words, correct answers, errors, with the output of animations depending on the correctness of the answer. There is a panel with image prompts, audio playback, and transcription added.
ru: Режим обучения со словарём схож с режимом тренировок со словами пользователя, также имеется панель для вывода оставшихся слов, правильных ответов, ошибок, с выводом анимаций в зависимости от правильности ответа. Есть панель с подсказками изображений, воспроизведение аудио, и добавлена транскрипция.

# Discrip
source: The application is designed for memorizing and learning English words. The user is given the opportunity to add, save and use certain words. The words are stored in the following variants: - English version; - Russian version; -image visualization; - sound format.
ru: Приложение предназначено для запоминания и изучения английских слов. Пользователю предоставляется возможность добавлять, сохранять и использовать определённые слова. Хранение слов осуществляется в следующих вариантах: - английский вариант; - русский вариант; -визуализация изображение; - звуковой формат.

# StringEight
source: Working with the dictionary
ru: Работа со словарем

# StringFive
source: Viewing words
ru: Просмотр слов

# StringFour
source: To add a word, go to the tab (add a word) in the main panel or click on the button (Add a word) in the view of all words!
ru: Для добавления слова нужно перейти по вкладке (пополнить слово) в главной панели или в просмотре всех слов нажать на кнопку (Добавить слово)!

# StringNine
source: User`s page
ru: Страничка пользователя

# StringOne
source: User Registration
ru: Регистрация пользователя

# StringSeven
source: Training - lesson
ru: Тренировка - Урок

# StringSix
source: To add a word, you need to fill out a form in which the first two fields are required! Uploading image and sound files as desired. After downloading, the added word can be seen first in the list on the All words page. In case of an error or the need to delete a word, you can delete it from the form for viewing all words by clicking (Edit) or (Delete).
ru: Для добавления слова необходимо заполнить форму в которой первые два поля обязательны! Загрузку файлов изображения и звука по желанию. После загрузки добавленное слово можно увидеть первым в списке на странице просмотра всех слов. В случае ошибки или необходимости удаления слова его можно удалить из формы просмотра всех слов по кнопкам (Изменить) или (Удалить).

# StringThree
source: Adding words
ru: Добавление слов

# StringTwo
source: After registration, a link will appear to which you need to click (Fig.3) to confirm registration. To log in, follow the Login link, where you also need to enter your email address and password. And if everything is fine, navigation buttons appear in the panel.
ru: После регистрации появится ссылка на которую необходимо нажать (рис.3), для подтверждения регистрации. Для авторизации необходимо перейти по ссылке Login, где также необходимо ввести адресс электронной почты и пароль. И если все хорошо в панели появляется кнопки навигации.

# Title
source: Guide to using the application.
ru: Руководство по использованию приложения.

# Title1
source: A WEB application for learning and replenishing the vocabulary of the English language.
ru: WEB приложение по изучению и пополнению запаса слов английского языка.

# Title10
source: The application is designed to add and memorize English words, for each user there is a library of words with which he can periodically work to replenish, repeat, view. If you are lazy to constantly replenish new words, then you can work with a shared library of words, without the possibility of replenishment, but you can also view words, repeat, and train. The training results are recorded, and the user can view the results of his work for the week.
ru: Приложение предназначенно для добавления и запоминания английских слов, для каждого пользователя существует своя библиотека слов с которой он может переодически работать пополнять, повторять, просматривать. Если вы ленитесь постоянно пополнять новые слова, то можите работать с общей библиотекой слов, без возможности пополнения, но также можно проводить просмотр слов, повторение, тренировки. Результаты тренировок записываются, и пользователь может просмотреть результаты своей работы за неделю.

# Title11
source: For authorization and registration in the upper right corner of the application there is a form with registration and authorization buttons (fig1). The functionality of the application is not available without user registration.
ru: Для авторизации и регистрации в правом верхнем углу приложения есть форма с кнопками регистрации и авторизации (рис1). Без регистрации пользователя функциональность приложения недоступна.

# Title12
source: After clicking on the registration button, we get to the form (Fig.2), where you need to enter an email address and come up with a password. The password must contain Latin alphabet characters in both uppercase and lowercase, special characters, numbers.
ru: После нажатия на кнопку регистрации мы попадаем в форму (рис.2), где вам нужно ввести адрес электронной почты и придумать пароль. Пароль должен содержать символы латинского алфавита как в верхнем, так и в нижнем регистре, специальные символы, цифры.

# Title13
source: In the training mode, you can click on the Lessons button in the navigation panel. There are three types of classes to choose from in the drop-down list:
ru: В режиме тренинга вы можете перейти по кнопке Уроки, в панели навигация. В выпадающем списке на выбор предлагаются три вида занятий:

# Title14
source: 1. The word by ear, according to the word pronounced by the computer, it is necessary to enter it in English;
ru: 1. Слово на слух, по произнесенному компьютером слову необходимо ввести его на английском языке;

# Title15
source: 2. The word in English, for the specified English word, you must enter a translation in Russian;
ru: 2. Слово по английскому, по указанному английскому слову необходимо ввести перевод на русском;

# Title16
source: Russian Russian word, for the specified Russian word, it is necessary to enter a translation in English.;
ru: 3. Слово по русскому, по указанному русскому слову необходимо ввести перевод на английском;

# Title17
source: Whatever you choose, in any case you will be redirected to the page with the word selection settings, where you can choose any option for choosing the number of words and their location, as well as choose words on the topics you set.
ru: Что бы вы не выбрали в любом случае вас направит на страницу с настройками по выбору слов, где вы можете выбрать различную вариацию выбора количество слов их расположение, а также выбрать слова, по установленным вами темам.

# Title18
source: The interface of the training page is very informative and simple, there is a panel for displaying the remaining words, correct answers and incorrect answers. The user enters the intended word into the form and after clicking, a check is performed. If the answer is correct, a joyful animation appears, if the answer is incorrect, a sad icon appears.
ru: Интерфейс обучающей страницы очень информативен и прост, есть панель для отображения оставшихся слов, правильных и неправильных ответов. Пользователь вводит нужное слово в форму, и после нажатия выполняется проверка. Если ответ правильный, появляется радостная анимация, если ответ неправильный, появляется грустный значок.

# Title19
source: There is also the possibility of a hint by clicking on the icon with a question, depending on the available data, an image appears, an icon for audio listening to the word, and finally an icon for viewing the correct answer.
ru: Также существует возможность подсказки по нажатию на иконку с вопросиком, в зависимости от имеющихся данных, появляется изображение, иконка для аудио прослушивания слова, и окончательно иконка для просмотра правильного ответа.

# Title2
source: When learning a foreign language, it is very important to constantly replenish your vocabulary — to learn new and new words. However, not everyone succeeds in doing this with success. To successfully memorize new words, it is better to use an associative image, it is better if the image is bright, strange or funny — so it will be more reliably remembered. another assistant in the study is the auditory perception and pronunciation of the studied word, a ready-made illustration or sound file can be picked up in Google.
ru: При изучении иностранного языка очень важно постоянно пополнять свой лексический запас — учить новые и новые слова. Однако не у всех получается делать это с успехом. Для успешного запоминания новых слов лучше использовать ассоциативное изображение, лучше если изображение будет ярким, странным или смешным — так оно надежнее запомнится. ещё одним помощником в изучении является слуховое восприятие и произношение изучаемого слова, готовую иллюстрацию или звуковой файл можно подобрать в Google.

# Title20
source: At the end of the words, the lesson ends and you get to the page with the results of the lesson. You are offered the choice of saving the lesson results.
ru: По окончанию слов урок заканчивается и вы попадаете на страницу с результатами урока. Вам предлагается выбор сохранения результатов урока.

# Title3
source: This probably happened to you at school: you learned a dozen new English words, did your homework, wrote a dictation… And a month later, everyone forgot. This is because new vocabulary needs to be repeated periodically and refreshed in memory. There is even a recommended schedule of repetitions of English words, compiled on the basis of the works of German psychologist Hermann Ebbinghaus:
ru: Вероятно, с вами такое случалось в школе: выучили десяток новых английских слов, сделали домашнее задание, написали диктант… И спустя месяц все забыли. Так происходит потому, что новую лексику нужно периодически повторять и освежать в памяти. Есть даже рекомендованный график повторений английских слов, составленный на основе трудов немецкого психолога Германа Эббингауза:

# Title4
source: - use the word again in 20-30 minutes;
ru: - снова использовать слово через 20–30 минут;

# Title5
source: - repeat the word every other day;
ru: - повторить слово через день;

# Title6
source: - return to a new word after 2-3 weeks;
ru: - вернуться к новому слову спустя 2–3 недели;

# Title7
source: - repeat the word in 2-3 months;
ru: - повторить слово через 2–3 месяца;

# Title8
source: - fix the word after 2-3 years.
ru: - закрепить слово спустя 2–3 года.

# Title9
source: It is on this method of memorization that the application for learning English words is based. The user is given an individual opportunity to digitally store foreign words with an image and sound accompaniment. Conducting study classes by constantly browsing in training mode. Adding five words every day, and conducting daily training for a short period of time, your vocabulary will be significantly replenished, and most importantly, it will be stored digitally, and at any moment it can be recalled, repeated, refreshed in your memory.
ru: Именно на этом способе запоминания основано приложение для изучения английских слов. Пользователю создаётся индивидуальная возможность цифрового хранения иностранных слов с изображением и звуковым сопровождением. Проведение занятий по изучению путём постоянного просматривания в режиме тренировки. Добавляя каждый день по пять слов, и проводя ежедневные тренировки за незначительный промежуток времени ваш словарный запас значительно пополнится, а самое главное, что он будет хранится в цифровом варианте, и в любой момент его можно будет вспомнить, повторить, освежить в своей памяти.

# UserPage
source: The user's page includes three modes:
ru: Страничка пользователя включает три режима:

# UserPage1
source: 1.The user's progress is designed to view the user's results for the week;
ru: 1.Прогресс пользователя предназначен для просмотра результатов пользователя за неделю;

# UserPage2
source: 2.The user's result shows what place the user occupies between all users of the application;
ru: 2.Результат пользователя показывает, какое место пользователь занимает между всеми пользователями приложения;

# UserPage3
source: 3.Your account displays user information;
ru: 3.Ваша учётная запись отображает информацию о пользователе;

# UserPage4
source: In the user's results viewing mode, you can view the progress on a certain day during the week by clicking on the play icon, of course only if there is data about the user's active lessons. The animated icon at the bottom indicates the presence of a result, the fire indicates the absence of a result, the award cup indicates the presence of a result.
ru: В режиме просмотра результатов пользователя можно просмотреть прогресс в определённый день в течении недели нажатием на иконку play, конечно только в случае имеющихся данных об активных уроках пользователя. Анимационная иконка в нижней части указывает о наличии результата, огонь - отсутствие результата, наградной кубок о наличии результата.

# UserPage5
source: In the user results mode, you can see what place the current user occupies among users in terms of word skills. In addition, the top three winners are displayed.
ru: В режиме результаты пользователя, можно увидеть какое место среди пользователей по навыкам владения словами, занимает текущий пользователь. В дополнение отображается тройка победителей.

# UserPage6
source: In your account, you can not only view data about yourself, but also change the avatar image, username instead of email address, all this can be done by clicking on certain Pencil icons.
ru: В вашей учётной записи вы можете не только просмотреть данные о себе но и сменить изображение аватарки, имя пользователя вместо адреса электронной почты, все это можно сделать при помощи нажатия на определённые иконки Pencil.
